#!/bin/bash

# Извежда списък на файловете с текущата директория сортирани по време на създаване.
# Разпечетва съдържанието на екрана на тези два от тях, които са с най-малък размер
# в байтове, прави ги с пълни права на достъп за собственика, четене и писане на групата,
# само четене на всички останали. Създава нова директория FIRST.
# Прави две копия на едния от тях – f1 и f2 в току-що създадената директория.
# Изтрива първичния файл./CHANGE_FILES/

ls -t

f1=$(ls -S -r | tail -n 1)
f2=$(ls -S -r | head -n 2 | tail -n 1)


cat $f1 $f2
chmod 764 $f1 $f2
mkdir FIRST

cp $f1 FIRST/
cp $f2 FIRST/

rm $f1

