#!/bin/bash

# В директория /home/KN/student се намира файл ff със съдържание символен низ.
# Да се състави командна порцедура, която получава три позиционни
# параметъра – две имена на директории и един символен низ.
# Ако не е подаден символен низ се взима низа, от посочения по-горе файл.
# Процедурата прехвърля всички файлове от текушата директория с разщирение .с
# в първата подадена директория, а тези с разширение .out
# във втората. Извежда на стандартния изход с подходящо 
# съобщение общия брой на непрехвърлените  файлове.


# Local env so using test file ff in current directory
dir1=$1
dir2=$2

expr $# \> 2 >/dev/null && str=$3 || str=$(cat ff)

echo $str

mv *.c $dir1
mv *.out $dir2

find . -maxdepth 1 -type f | wc -l
