#!/bin/bash

# Да се състави командна процедура, която получава при стартиране в командния ред
# два параметъра – символен низ и число. Ако съществува директория с
# име съвпадащо с низа, процедурта извежда на стандартния изход имената
# на всички обикновени файлове от тази директория,
# чийто  размер е по-голям от подаденото число. В противен случай/не
# съществува такава директория/ - на стандартния изход се извежда подходящо съобщение.

dir=$1
size=$2

if [[ ! -d $dir ]]; then
    echo "Directory '$dir' does not exist"
    exit 1
fi

# input size is in bytes
size+='c'

find $dir -type f -size +$size
