#!/bin/bash

# В директория /home/KN/student се намира файл f_niz със съдържание символен низ.
# Да се състави командна порцедура, която получава три позиционни
# параметъра – две имена на директории и един символен низ.
# Ако не е подаден символен низ се взима низа, от посочения по-горе файл.
# Процедурата прехвърля всички файлове от текушата директория с разщирение .с
# в първата подадена директория, а тези с разширение .out  във втората.
# Извежда на стандартния изход с подходящо съобщение общия брой на непрехвърлените
# файлове. Създава директория с име подадения низ, ако такава несъществува.
# Записва в нея във файл names имената на всички прехвърлени файлове.


