#!/bin/bash

# Да се състави командна процедура, която получава при стартиране
# в командния ред два параметъра – имена на съществуващи директории.
# Ако броят на файловете, чието разширение е „txt” в първата директория
# е по-голям от броя на същите във втората директория, процедурата прочита
# от стандартния вход име на трета директория и създава поддиректория
# на текущата с прочетеното име. Премества в нея всички обикновени файлове
# от първата директория, които са достъпни за четене и писане,
# но не за изпълнение.

# run with arguments: dir1 dir2

dir1=$1
dir2=$2

dir1_count=$(find $dir1 -type f -name "*.txt" | wc -l)
dir2_count=$(find $dir2 -type f -name "*.txt" | wc -l)

if [[ $dir2_count -ge $dir1_count ]]; then
    exit 0
fi


read dir3
mkdir $dir3

files=$(find $dir1 -type f -perm 666)
for file in $files; do
    mv $file $dir3
done

