#!/bin/bash

# Да се състави командна процедура, която  приема като параметър в командния
# ред име на потребител и име файл. Взима от последния ред на подадния файл
# думата от началото на реда до първото срещане на символа 1 и проверява дали
# във файловата система с корен родителската директория на началната
# потребителска директория има файлове в указаното име и ако да –извежда на
# екрана броя им, а ако не – изпраща  подходящо съобщение на потребителя подаден
# като параметър./SUBNIZ_FILE/

usr=$1
file=$2

fname=$(cat $file | tail -n 1 | cut -d '1' -f 1)
files_count=$(find $HOME/../ -name $fname | wc -l)

if [[ $files_count -gt 0 ]]; then
    echo $files_count
else
    echo "No such files exist with name: $fname" | write $usr
fi
